app/controllers/sound_bytes_controller.rb

    def index
        @sound_bytes = SoundByte.order('created_at')
---
SELECT "sound_bytes".* FROM "sound_bytes"  ORDER BY created_at

    def create
        @sound_byte = SoundByte.new(sound_byte_params)
        if @sound_byte.save
---
INSERT INTO "sound_bytes" ("mpeg_file_name", "mpeg_content_type", "mpeg_file_size", "mpeg_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)